perf/baseline-bbox.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox"
    cluster:
      target: 'http://localhost:5555/node/cluster'
      plugins:
        statsd:
        host: localhost
        port: 8125
        prefix: "artillery-bbox"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 30
    

scenarios:
  - name: Bbox0
    flow:
      - get:
          url: '/bbox/0'
  - name: Bbox1
    flow:
      - get:
          url: '/bbox/1'